{
  "architectures": [
    "ModernBertForSequenceClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "cls",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "Adult",
    "1": "Arts_and_Entertainment",
    "2": "Autos_and_Vehicles",
    "3": "Beauty_and_Fitness",
    "4": "Books_and_Literature",
    "5": "Business_and_Industry",
    "6": "Career_and_Education",
    "7": "Computer_and_Electronics",
    "8": "Finance",
    "9": "Food_and_Drink",
    "10": "Gambling",
    "11": "Games",
    "12": "Health",
    "13": "Home_and_Garden",
    "14": "Internet_and_Telecom",
    "15": "Law_and_Government",
    "16": "News_and_Media",
    "17": "People_and_Society",
    "18": "Pets_and_Animals",
    "19": "Recreation_and_Hobbies",
    "20": "Reference",
    "21": "Science",
    "22": "Shopping",
    "23": "Sports",
    "24": "Travel"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "Adult": 0,
    "Arts_and_Entertainment": 1,
    "Autos_and_Vehicles": 2,
    "Beauty_and_Fitness": 3,
    "Books_and_Literature": 4,
    "Business_and_Industry": 5,
    "Career_and_Education": 6,
    "Computer_and_Electronics": 7,
    "Finance": 8,
    "Food_and_Drink": 9,
    "Gambling": 10,
    "Games": 11,
    "Health": 12,
    "Home_and_Garden": 13,
    "Internet_and_Telecom": 14,
    "Law_and_Government": 15,
    "News_and_Media": 16,
    "People_and_Society": 17,
    "Pets_and_Animals": 18,
    "Recreation_and_Hobbies": 19,
    "Reference": 20,
    "Science": 21,
    "Shopping": 22,
    "Sports": 23,
    "Travel": 24
  },
  "layer_norm_eps": 1e-05,
  "layer_types": [
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "local_attention": 128,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "rope_parameters": {
    "full_attention": {
      "rope_theta": 160000.0,
      "rope_type": "default"
    },
    "sliding_attention": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "vocab_size": 50368
}
